read_verilog src/module/vsdbabysoc.v
read_verilog -I src/include src/module/RV_CPU.v
read_verilog -I src/include src/module/clk_gate.v
read_liberty -lib lib/avsdpll.lib
read_liberty -lib lib/avsddac.lib
read_liberty -lib lib/sky130_fd_sc_hd__tt_025C_1v80.lib
synth -top vsdbabysoc
dfflibmap -liberty lib/sky130_fd_sc_hd__tt_025C_1v80.lib
abc -liberty lib/sky130_fd_sc_hd__tt_025C_1v80.lib
flatten
write_verilog -noattr src/module/vsdbabysoc_synth.v